## NN parameters

Мэдрэлийн сүлжээний параметрүүд нь мэдрэлийн сүлжээний үйл ажиллагаа, гүйцэтгэлийг тодорхойлдог утгууд юм. Эдгээр параметрүүд нь: 

* Жин: Жин гэдэг нь сүлжээн дэх нейронуудын хоорондын холболтын хүчийг тодорхойлдог үзүүлэлт юм. Урьдчилан таамагласан гаралт болон бодит гаралтын хоорондох алдааг багасгахын тулд тэдгээрийг сургалтын явцад шинэчилдэг. 

* Bias: Хазайлт нь нейроны идэвхжүүлэх функцийг өөрчилдөг параметрүүд юм. Эдгээр нь өгөгдлийг илүү сайн тохируулахын тулд нейроны гаралтыг тохируулахад ашиглагддаг. 

* Сурах хувь: Сургалтын хурд нь сургалтын явцад жин, хазайлтыг шинэчлэх алхамын хэмжээг тодорхойлдог гиперпараметр юм. Сурах хурд бага байх нь нийлэлтийг удаашруулдаг боловч оновчтой шийдлийг давахаас зайлсхийхэд тусалдаг. Илүү их суралцах хурд нь илүү хурдан нийлэхэд хүргэдэг, гэхдээ энэ нь сүлжээг хэлбэлзүүлэх эсвэл оновчтой шийдлийг алдахад хүргэдэг. 

* Идэвхжүүлэх функцууд: Идэвхжүүлэх функцууд нь нейроны оролт дээр үндэслэн гаралтыг тодорхойлдог. Эдгээрийг нейроны гаралтад шугаман бус байдлыг нэвтрүүлэхэд ашигладаг. Идэвхжүүлэх нийтлэг функцуудад sigmoid, tanh, ReLU, softmax орно. Далд давхаргын тоо: 

* Нуугдсан давхаргын тоо нь сүлжээний нарийн төвөгтэй байдлыг тодорхойлдог. Илүү далд давхаргууд нь нарийн төвөгтэй өгөгдөлд багтах сүлжээний хүчин чадлыг сайжруулж болох ч хэт их ачаалал өгөх эрсдэлийг нэмэгдүүлдэг. Давхарга бүрийн нейроны тоо: Давхарга тус бүрийн нейроны тоо нь сүлжээн дэх параметрийн тоог тодорхойлдог. Илүү олон мэдрэлийн эсүүд нь илүү өндөр хүчин чадалтай илүү төвөгтэй сүлжээг бий болгодог боловч энэ нь хэт их ачаалал өгөх эрсдэлийг нэмэгдүүлдэг. Зохицуулалтын параметрүүд: Тогтворжуулах параметрүүд нь хэт тохируулга хийхээс сэргийлэхэд ашигладаг гиперпараметрүүд юм. Тогтворжуулах нийтлэг аргууд нь L1-ийн зохицуулалт, L2-ийн зохицуулалт, сургууль завсардалт зэрэг орно. Эдгээр нь мэдрэлийн сүлжээн дэх зарим гол параметрүүд бөгөөд эдгээр параметрүүдийн оновчтой утгыг гиперпараметрийн тааруулах гэж нэрлэдэг процессоор тодорхойлдог. Гиперпараметр тааруулах зорилго нь баталгаажуулалтын багц дээр хамгийн сайн гүйцэтгэлийг бий болгодог параметрүүдийн хамгийн сайн хослолыг олох явдал юм.

### Forward Propagation

Forward propagation гэдэг нь гаралтын дохиог үүсгэхийн тулд оролтын өгөгдлийг мэдрэлийн сүлжээгээр дамжуулах үйл явц юм. 
Энэ нь мэдрэлийн сүлжээг үнэлэх эхний алхам бөгөөд оролтын өгөгдөл дээр үндэслэн таамаглал гаргахад ашигладаг. 
Урагш тархах үед оролтын өгөгдөл нь мэдрэлийн сүлжээний давхарга бүрээр урагш чиглэн дамжих ба давхарга бүрийн нейронуудын гаралтыг дараагийн давхаргын нейронуудын оролт болгон ашигладаг. 
Нейрон тус бүрээр хийсэн тооцоолол нь сургалтын явцад олж авсан жин, хэвийсэн хандлага дээр суурилдаг. 
Урагш түгээх үйл явцыг дараах байдлаар тодорхойлж болно. Оролтын өгөгдлийн хамт оролтын давхаргыг эхлүүлэх. Нуугдсан давхарга бүрийн хувьд: Давхаргын нейрон бүрийн оролтын жигнэсэн нийлбэрийг гүйцэтгэнэ. 
Нейроны гаралтыг гаргахын тулд жигнэсэн нийлбэрт идэвхжүүлэх функцийг хэрэглэнэ. Гаралтын давхаргын хувьд: Давхаргын нейрон бүрийн оролтын жигнэсэн нийлбэрийг гүйцэтгэнэ. Сүлжээний эцсийн гаралтыг гаргахын тулд жигнэсэн нийлбэрт идэвхжүүлэх функцийг хэрэглэнэ. Урагшаа тархах процесс нь сүлжээний гаралтын дохиог үүсгэдэг бөгөөд үүнийг оролтын өгөгдөл дээр үндэслэн таамаглал гаргахад ашиглаж болно. Гаралтын дохиог сургалтын үйл явцын ухрах үе шатанд зорилтот утга болгон ашиглаж болно.

### step by step

Энгийн мэдрэлийн сүлжээний загварыг бий болгох алхам алхмаар зааварчилгаа энд байна. 

* `Өгөгдлийг ачаалах, бэлтгэх:` Өгөгдлийн багцыг ачаалж, сургалт, туршилтын багц болгон хуваа. Өгөгдлийг мэдрэлийн сүлжээнд тохирох форматтай байлгахын тулд функцуудыг хэвийн болгох, масштаблах гэх мэт өгөгдлийг урьдчилан боловсруул. Загварын архитектурыг тодорхойлох: 

* `Далд давхаргын тоо, давхарга бүрийн нейроны тоо, ашиглах идэвхжүүлэх функцийн төрлийг сонгоно уу. 

* `Загварын жинг эхлүүлэх:` Загварын жинг санамсаргүй байдлаар 0-тэй ойролцоо жижиг утгуудад тохируулна. 

* `forward propagation`: Оролтын онцлог ба жингийн цэгийн үржвэрийг тооцоолж, дараа нь нейрон бүрийн гаралтыг авахын тулд үр дүнг идэвхжүүлэх функцээр дамжуулна. Эцсийн таамаглал гарах хүртэл энэ үйлдлийг бүх далд давхаргын хувьд давтана. 

* `compute the loss:` Загварын таамаглалыг бодит label харьцуулж, дундаж квадрат алдаа эсвэл категорик кросс-энтропи гэх мэт алдагдлын функцийг ашиглан алдагдлыг тооцоол. 

* `Backpropagation:` Алдааг сүлжээгээр дахин түгээж, алдагдлыг багасгахын тулд жинг тохируулна. Үүнийг градиент уналтын оновчлол эсвэл өөр оновчлолын аргыг ашиглан хийдэг. 

* `Процессыг давт:` Сургалтын өгөгдөл дээр загварыг сургахын тулд 4-6-р алхмуудыг олон удаа давтана. 

* `Загварыг үнэлэх:` Туршилтын өгөгдөл дээр таамаглал дэвшүүлэхийн тулд бэлтгэгдсэн загварыг ашиглан нарийвчлал, нарийвчлал, санах ой, F1 оноо гэх мэт үзүүлэлтүүдийг ашиглан гүйцэтгэлийг нь үнэлнэ үү. 

* `Загварыг нарийн тааруулах:` Хэрэв гүйцэтгэл нь хангалтгүй байвал загварын гүйцэтгэлийг сайжруулахын тулд загварын архитектур, идэвхжүүлэх функц эсвэл оновчлолын аргыг тохируулна уу. Хүссэн гүйцэтгэлд хүрэх хүртэл бүх үйл явцыг давтана.
